app/controllers/movies_controller.rb

    def index
        @movies = Movie.all.includes(:user)
---
SELECT "movies".* FROM "movies"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 17], ["id", 18], ["id", 19]]

    def user_cant_react_to_his_movies
        movie = Movie.find_by(id: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    def create
        @movie = Movie.create(movie_params)
---
INSERT INTO "movies" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "whatthefuck"], ["description", "asfdaef"], ["user_id", 17], ["created_at", "2022-11-10 23:04:47.749598"], ["updated_at", "2022-11-10 23:04:47.749598"]]

    def update_reaction_type(reaction_type)
        if reaction.ttype == reaction_type
            reaction.destroy
            redirect_to movies_url
        else
            reaction.ttype = reaction_type
            if reaction.save
---
DELETE FROM "reactions" WHERE "reactions"."id" = $1  [["id", 54]]
UPDATE "reactions" SET "ttype" = $1, "updated_at" = $2 WHERE "reactions"."id" = $3  [["ttype", "HATE"], ["updated_at", "2022-11-10 20:32:05.544508"], ["id", 54]]

    def reaction
        @reaction ||= Reaction.find_by(user_id: current_user.id, movie_id: params[:id])
---
SELECT  "reactions".* FROM "reactions" WHERE "reactions"."user_id" = $1 AND "reactions"."movie_id" = $2 LIMIT $3  [["user_id", 17], ["movie_id", 15], ["LIMIT", 1]]

    def create_new_reaction(reaction_type)
        @reaction = Reaction.new(user_id: current_user.id, movie_id: params[:id], ttype: reaction_type)
        if @reaction.save
---
INSERT INTO "reactions" ("ttype", "user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ttype", "LIKE"], ["user_id", 17], ["movie_id", 15], ["created_at", "2022-11-10 20:32:09.835196"], ["updated_at", "2022-11-10 20:32:09.835196"]]