app/controllers/movies_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def index
        if params[:user_id]
            @user = User.find_by(id: params[:user_id])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
    def user_cant_react_to_his_movies
        movie = Movie.find_by(id: params[:id])

DELETE FROM "reactions" WHERE "reactions"."id" = $1  [["id", 106]]
UPDATE "reactions" SET "ttype" = $1, "updated_at" = $2 WHERE "reactions"."id" = $3  [["ttype", "HATE"], ["updated_at", "2022-11-11 01:39:16.366012"], ["id", 111]]
---
    def update_reaction_type(reaction_type)
        if reaction.ttype == reaction_type
            reaction.destroy
            redirect_back(fallback_location: movies_url)
        else
            reaction.ttype = reaction_type
            if reaction.save

SELECT  "reactions".* FROM "reactions" WHERE "reactions"."user_id" = $1 AND "reactions"."movie_id" = $2 LIMIT $3  [["user_id", 32], ["movie_id", 27], ["LIMIT", 1]]
---
    def reaction
        @reaction ||= Reaction.find_by(user_id: current_user.id, movie_id: params[:id])

INSERT INTO "reactions" ("ttype", "user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ttype", "LIKE"], ["user_id", 32], ["movie_id", 27], ["created_at", "2022-11-11 01:39:13.324938"], ["updated_at", "2022-11-11 01:39:13.324938"]]
---
    def create_new_reaction(reaction_type)
        @reaction = Reaction.new(user_id: current_user.id, movie_id: params[:id], ttype: reaction_type)
        if @reaction.save