app/controllers/movies_controller.rb

    def show
        @movie = Movie.find_by(id: params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]