app/controllers/users_controller.rb

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Hey"], ["password_digest", "$2a$12$PA/kbxP6NBBaeIjTRzI3LO2p.qvtssQ7O7Pe909Rolz4tEk.JycJ6"], ["created_at", "2022-11-08 19:19:38.810524"], ["updated_at", "2022-11-08 19:19:38.810524"]]