app/models/movie.rb

    def likes
        @likes = self.reactions.where(ttype: Reaction::LIKE).count
---
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."movie_id" = $1 AND "reactions"."ttype" = $2  [["movie_id", 14], ["ttype", "LIKE"]]

    def hates
        @hates = self.reactions.where(ttype: Reaction::HATE).count
---
SELECT COUNT(*) FROM "reactions" WHERE "reactions"."movie_id" = $1 AND "reactions"."ttype" = $2  [["movie_id", 14], ["ttype", "HATE"]]