app/models/user.rb

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."user_id" = $1 AND "reactions"."ttype" = $2 AND "reactions"."movie_id" = $3  [["user_id", 17], ["ttype", "LIKE"], ["movie_id", 14]]
---
    def likes_movie(movie_id)
        self.reactions.where(ttype: Reaction::LIKE, movie_id: movie_id).count

SELECT COUNT(*) FROM "reactions" WHERE "reactions"."user_id" = $1 AND "reactions"."ttype" = $2 AND "reactions"."movie_id" = $3  [["user_id", 17], ["ttype", "HATE"], ["movie_id", 15]]
---
    def hates_movie(movie_id)
        self.reactions.where(ttype: Reaction::HATE, movie_id: movie_id).count